package com.redartis.tg.util;

public interface TelegramBotAnswer {
    String ACCOUNT_NOT_FOUND_MESSAGE = """
            Схоже, у вас ще немає облікового запису. \
            Надішліть /start, щоб створити особистий обліковий запис або \
            авторизуйтесь через веб-додаток: %s""";
    String TRANSACTION_MESSAGE_INVALID = """
            Нам не вдалося розпізнати ваше повідомлення.
            Переконайтеся, що сума та назва правильні, і повторіть спробу""";
    String MERGE_REQUEST_TEXT = """
            Привіт, ви додали мене в груповий чат, тепер я буду відстежувати транзакції \
            всіх користувачів цього чату.
            Чи хочете ви перенести свої фінансові дані та поділитися ними?""";
    String MERGE_REQUEST_COMPLETED_DEFAULT_TEXT = "Щасливого користування";
    String MERGE_REQUEST_COMPLETED_TEXT = "Дані облікового запису були успішно перенесені";
    String REGISTRATION_INFO_TEXT = """
            Щоб правильно зареєструвати свій обліковий запис, переконайтеся, \
            що на момент додавання бота в чат ви перебуваєте в ньому самі. \
            Після перенесення даних ви можете додати інших користувачів""";
    String INVALID_TRANSACTION_TO_DELETE = "Недійсна транзакція для видалення";
    String SUCCESSFUL_DELETION_TRANSACTION =
            "Ця транзакція була успішно видалена!";
    String SUCCESSFUL_UPDATE_TRANSACTION_TEXT =
            "Транзакція успішно модифікована.\n";
    String INVALID_UPDATE_TRANSACTION_TEXT = """
            Недійсна транзакція для зміни. Можливо, ви вибрали повідомлення бота \
            або транзакцію, яка вже була змінена""";

    String VOICE_MESSAGE_TOO_LONG = """
            На жаль, ми не можемо розпізнати голосове повідомлення довше %d секунд. \
            Спробуйте розбити його на менші частини :)""";

}
